IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/I2C2_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="I2C2" HW_revision="1.0">
    <group id="I2C2_GPRCM" name="I2C2_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="I2C2_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="I2C2_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="I2C2_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Not block async clock request"/>
                <bitenum id="ENABLE" value="0x1" description="Block async clock request"/>
            </bitfield>
        </register>
        <register id="I2C2_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
    </group>
    <register id="I2C2_CLKDIV" width="32" offset="0x1000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="I2C2_CLKSEL" width="32" offset="0x1004" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="MFCLK_SEL" description="Selects MFCLK as clock source if enabled" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="BUSCLK_SEL" description="Selects BUSCLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="I2C2_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="I2C2_INT_EVENT0" name="I2C2_INT_EVENT0" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="I2C2_INT_EVENT0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="MRXDONEFG" value="0x1" description="Master data received"/>
                <bitenum id="MTXDONEFG" value="0x2" description="Master data transmitted"/>
                <bitenum id="MRXFIFOTRG" value="0x3" description="Master receive FIFO Trigger Level"/>
                <bitenum id="MTXFIFOTRG" value="0x4" description="Master transmit FIFO Trigger level"/>
                <bitenum id="MRXFIFOFULL" value="0x5" description="RX FIFO FULL Event/interrupt pending"/>
                <bitenum id="MTX_EMPTY" value="0x6" description="Transmit FIFO/Buffer Empty Event/interrupt pending"/>
                <bitenum id="MNACKFG" value="0x8" description="Address/Data NACK"/>
                <bitenum id="MSTARTFG" value="0x9" description="Start Event"/>
                <bitenum id="MSTOPFG" value="0xA" description="Stop Event"/>
                <bitenum id="MARBLOSTFG" value="0xB" description="Arbitration Lost"/>
                <bitenum id="MDMA_DONE_TX" value="0xC" description="DMA DONE on Channel TX"/>
                <bitenum id="MDMA_DONE_RX" value="0xD" description="DMA DONE on Channel RX"/>
                <bitenum id="MPEC_RX_ERR" value="0xE" description="Master PEC Receive Error Event"/>
                <bitenum id="TIMEOUTA" value="0xF" description="Timeout A Event"/>
                <bitenum id="TIMEOUTB" value="0x10" description="Timeout B Event"/>
                <bitenum id="SRXDONEFG" value="0x11" description="Slave Data Event"/>
                <bitenum id="STXDONEFG" value="0x12" description="Slave Data Event"/>
                <bitenum id="SRXFIFOTRG" value="0x13" description="Slave receive FIFO Trigger Level"/>
                <bitenum id="STXFIFOTRG" value="0x14" description="Slave transmit FIFO Trigger level"/>
                <bitenum id="SRXFIFOFULL" value="0x15" description="RX FIFO FULL Event/interrupt pending"/>
                <bitenum id="STXEMPTY" value="0x16" description="Transmit FIFO/Buffer Empty Event/interrupt pending"/>
                <bitenum id="SSTARTFG" value="0x17" description="Start Event"/>
                <bitenum id="SSTOPFG" value="0x18" description="Stop Event"/>
                <bitenum id="SGENCALL" value="0x19" description="General Call Event"/>
                <bitenum id="SDMA_DONE_TX" value="0x1A" description="DMA DONE on Channel TX"/>
                <bitenum id="SDMA_DONE_RX" value="0x1B" description="DMA DONE on Channel RX"/>
                <bitenum id="SPEC_RX_ERR" value="0x1C" description="Slave PEC receive error event"/>
                <bitenum id="STX_UNFL" value="0x1D" description="Slave TX FIFO underflow"/>
                <bitenum id="SRX_OVFL" value="0x1E" description="Slave RX FIFO overflow event"/>
                <bitenum id="SARBLOST" value="0x1F" description="Slave arbitration lost event"/>
                <bitenum id="INTR_OVFL" value="0x20" description="Interrupt overflow event"/>
            </bitfield>
        </register>
        <register id="I2C2_INT_EVENT0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="MRXDONE" description="Master Receive Transaction completed Interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TIMEOUTA" description="Timeout A Interrupt" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MNACK" description="Address/Data NACK Interrupt" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MSTART" description="START Detection Interrupt" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MSTOP" description="STOP Detection Interrupt" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MARBLOST" description="Arbitration Lost Interrupt" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MTXDONE" description="Master Transmit Transaction completed Interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MRXFIFOFULL" description="RXFIFO full event. This interrupt is set if an RX FIFO is full." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MTXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MRXFIFOTRG" description="Master Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MTXFIFOTRG" description="Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MDMA_DONE_TX" description="DMA Done on Event Channel TX" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MDMA_DONE_RX" description="DMA Done on Event Channel RX" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SRXDONE" description="Slave Receive Data Interrupt
Signals that a byte has been received" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="STXDONE" description="Slave Transmit Transaction completed Interrupt" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SGENCALL" description="General Call Interrupt" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="STXEMPTY" description="Slave Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SRXFIFOFULL" description="RXFIFO full event. This interrupt is set if an Slave RX FIFO is full." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SRXFIFOTRG" description="Slave Receive FIFO Trigger" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="STXFIFOTRG" description="Slave Transmit FIFO Trigger" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SSTART" description="Start Condition Interrupt" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SSTOP" description="Stop Condition Interrupt" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SDMA_DONE_TX" description="Slave DMA Done on Event Channel TX" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SDMA_DONE_RX" description="Slave DMA Done on Event Channel RX" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="MPEC_RX_ERR" description="Master RX Pec Error Interrupt" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TIMEOUTB" description="Timeout B Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SPEC_RX_ERR" description="Slave RX Pec Error Interrupt" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="STX_UNFL" description="Slave TX FIFO underflow" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SRX_OVFL" description="Slave RX FIFO overflow" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="SARBLOST" description="Slave Arbitration Lost" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Set Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="INTR_OVFL" description="Interrupt Overflow Interrupt Mask" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
