IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/I2C2_1.0.xml
(Core Domain only)" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Bypass"/>
            <bitenum id="CLK_1" value="0x1" description="1 clock"/>
            <bitenum id="CLK_2" value="0x2" description="2 clocks"/>
            <bitenum id="CLK_3" value="0x3" description="3 clocks"/>
            <bitenum id="CLK_4" value="0x4" description="4 clocks"/>
            <bitenum id="CLK_8" value="0x5" description="8 clocks"/>
            <bitenum id="CLK_16" value="0x6" description="16 clocks"/>
            <bitenum id="CLK_31" value="0x7" description="31 clocks"/>
        </bitfield>
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
        <bitfield id="CHAIN" description="Analog and digital noise filters chaining enable." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="When 0, chaining is disabled and only digital filter output is available to IP logic for oversampling"/>
            <bitenum id="ENABLE" value="0x1" description="When 1, analog and digital glitch filters are chained and the output of the combination is made available to IP logic for oversampling"/>
        </bitfield>
    </register>
    <register id="I2C2_TIMEOUT_CTL" width="32" offset="0x1204" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 

Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
        <bitfield id="TCNTLB" description="Timeout Count B Load: Counter B is used for SCL High Detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout B count. NOTE: The value of CNTLB must be greater than 1h. 

Each count is equal to 1* clock period. For example, with 10MHz functional clock one timeout period will be equal to1*100ns." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTBEN" description="Timeout Counter B Enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>
    <register id="I2C2_TIMEOUT_CNT" width="32" offset="0x1208" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTB" description="Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="I2C2_MASTER" name="I2C2_MASTER" instances="1" offset="0x1210" instaddr="0x40" description="">
        <register id="I2C2_MSA" width="32" offset="0x0" description="I2C Master Slave Address Register">
            <bitfield id="DIR" description="Receive/Send
The DIR bit specifies if the next master operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="TRANSMIT" value="0x0" description="The master is in transmit mode."/>
                <bitenum id="RECEIVE" value="0x1" description="The master is in receive mode."/>
            </bitfield>
            <bitfield id="SADDR" description="I2C Slave Address This field specifies bits A9 through A0 of the slave address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care" begin="10" end="1" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
            </bitfield>
            <bitfield id="MMODE" description="This bit selects the adressing mode to be used in master mode
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="MODE7" value="0x0" description="7-bit addressing mode"/>
                <bitenum id="MODE10" value="0x1" description="10-bit addressing mode"/>
            </bitfield>
        </register>
        <register id="I2C2_MCTR" width="32" offset="0x4" description="I2C Master Control Register">
            <bitfield id="BURSTRUN" description="I2C Master Enable and start transaction" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="In standard mode, this encoding means the master is unable to transmit or receive data."/>
                <bitenum id="ENABLE" value="0x1" description="The master is able to transmit or receive data. See field decoding in Table: MCTR Field decoding."/>
            </bitfield>
            <bitfield id="START" description="Generate START" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The controller does not generate the START condition."/>
                <bitenum id="ENABLE" value="0x1" description="The controller generates the START or repeated START condition. See field decoding in Table: MCTR Field decoding."/>
            </bitfield>
            <bitfield id="STOP" description="Generate STOP" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The controller does not generate the STOP condition."/>
                <bitenum id="ENABLE" value="0x1" description="The controller generates the STOP condition. See field decoding in Table: MCTR Field decoding."/>
            </bitfield>
            <bitfield id="ACK" description="Data Acknowledge Enable.
Software needs to configure this bit to send the ACK or NACK.
