IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/I2C2_1.0.xml
        <register id="I2C2_MASTER_I2CPECCTL" width="32" offset="0x30" description="I2C master PEC control register">
            <bitfield id="PECCNT" description="PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Master use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Slave Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.

Note that any write to the MASTER_I2CPECCTL Register will clear the current PEC Byte Count in the Master State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits accept the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="PEC is disabled in master mode"/>
                <bitenum id="ENABLE" value="0x1" description="PEC is enabled in master mode"/>
            </bitfield>
        </register>
        <register id="I2C2_MASTER_PECSR" width="32" offset="0x34" description="I2C master PEC status register">
            <bitfield id="PECBYTECNT" description="PEC Byte Count	
This is the current PEC Byte Count of the Master State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates if the PEC was checked in the transaction that occurred before the last Stop"/>
            </bitfield>
            <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates if a PEC check error occurred in the transaction that occurred before the last Stop"/>
            </bitfield>
        </register>
    </group>
    <group id="I2C2_SLAVE" name="I2C2_SLAVE" instances="1" offset="0x1250" instaddr="0x30" description="">
        <register id="I2C2_SOAR" width="32" offset="0x0" description="I2C Slave Own Address">
            <bitfield id="OAR" description="I2C Slave Own Address: This field specifies bits A9 through A0 of the slave address.
In 7-bit addressing mode as selected by I2CSOAR.MODE bit, the top 3 bits are don't care" begin="9" end="0" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
            </bitfield>
            <bitfield id="OAREN" description="I2C Slave Own Address Enable" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable OAR address"/>
                <bitenum id="ENABLE" value="0x1" description="Enable OAR address"/>
            </bitfield>
            <bitfield id="SMODE" description="This bit selects the adressing mode to be used in slave mode.
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="MODE7" value="0x0" description="Enable 7-bit addressing"/>
                <bitenum id="MODE10" value="0x1" description="Enable 10-bit addressing"/>
            </bitfield>
        </register>
        <register id="I2C2_SOAR2" width="32" offset="0x4" description="I2C Slave Own Address 2">
            <bitfield id="OAR2" description="I2C Slave Own Address 2This field specifies the alternate OAR2 address." begin="6" end="0" width="7" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
            </bitfield>
            <bitfield id="OAR2EN" description="I2C Slave Own Address 2 Enable" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The alternate address is disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the use of the alternate address in the OAR2 field."/>
            </bitfield>
            <bitfield id="OAR2_MASK" description="I2C Slave Own Address 2 Mask: This field specifies bits A6 through A0 of the slave address.
The bits with value 1 in SOAR2.OAR2_MASK field will make the corresponding incoming address bits to match by default regardless of the value inside SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a dont care." begin="22" end="16" width="7" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x7F" description="Maximum Value"/>
            </bitfield>
        </register>
