IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/I2C2_1.0.xml
        <register id="I2C2_SCTR" width="32" offset="0x8" description="I2C Slave Control Register">
            <bitfield id="ACTIVE" description="Device Active. Setting this bit enables the slave functionality." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the I2C slave operation."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the I2C slave operation."/>
            </bitfield>
            <bitfield id="GENCALL" description="General call response enable
Modify only when UCSWRST = 1.
0b = Do not respond to a general call
1b = Respond to a general call" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Do not respond to a general call"/>
                <bitenum id="ENABLE" value="0x1" description="Respond to a general call"/>
            </bitfield>
            <bitfield id="SCLKSTRETCH" description="Slave Clock Stretch Enable" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Slave clock stretching is disabled"/>
                <bitenum id="ENABLE" value="0x1" description="Slave clock stretching is enabled"/>
            </bitfield>
            <bitfield id="TXEMPTY_ON_TREQ" description="Tx Empty Interrupt on TREQ" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, RIS:STXEMPTY will be set when only the Slave TX FIFO is empty. This allows the STXEMPTY interrupt to be used to indicate that the I2C bus is being clock stretched and that Slave TX data is required."/>
                <bitenum id="ENABLE" value="0x1" description="When 1, RIS:STXEMPTY will be set when the Slave State Machine is in the TX_WAIT state which occurs when the TX FIFO is empty AND the I2C transaction is clock stretched waiting for the FIFO to receive data."/>
            </bitfield>
            <bitfield id="TXTRIG_TXMODE" description="Tx Trigger when slave FSM is in Tx Mode" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When 1, RIS:TXFIFOTRG will be set when the Slave TX FIFO has reached the trigger level AND the Slave State Machine is in the TXMODE as defined in the SSR register. When cleared RIS:TXFIFOTRG will be set when the Slave TX FIFO is at or above the trigger level. This setting can be used to hold off the TX DMA until a transaction starts. This allows the DMA to be configured when the I2C is idle but have it wait till the transaction starts to load the Slave TX FIFO, so it can load from a memory buffer that might be changing over time."/>
            </bitfield>
            <bitfield id="TXWAIT_STALE_TXFIFO" description="Tx transfer waits when stale data in Tx FIFO.
This prevents stale bytes left in the TX FIFO from automatically being sent on the next I2C packet. Note: this should be used with TXEMPTY_ON_TREQ set to prevent the Slave State Machine from waiting for TX FIFO data without an interrupt notification when the FIFO data is stale." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, the TX FIFO empty signal to the Slave State Machine indicates that the TX FIFO is empty."/>
                <bitenum id="ENABLE" value="0x1" description="When 1, the TX FIFO empty signal to the Slave State Machine will indicate that the TX FIFO is empty or that the TX FIFO data is stale. The TX FIFO data is determined to be stale when there is data in the TX FIFO when the Slave State Machine leaves the TXMODE as defined in the SSR register. This can occur is a Stop or timeout occur when there are bytes left in the TX FIFO."/>
            </bitfield>
            <bitfield id="RXFULL_ON_RREQ" description="Rx full interrupt generated on RREQ condition as indicated in SSR" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, RIS:SRXFULL will be set when only the Slave RX FIFO is full. This allows the SRXFULL interrupt to be used to indicate that the I2C bus is being clock stretched and that the FW must either read the RX FIFO or ACK/NACK the current Rx byte."/>
                <bitenum id="ENABLE" value="0x1" description="When 1, RIS:SRXFULL will be set when the Slave State Machine is in the RX_WAIT or RX_ACK_WAIT states which occurs when the I2C transaction is clock stretched because the RX FIFO is full or the ACKOEN has been set and the state machine is waiting for FW to ACK/NACK the current byte."/>
            </bitfield>
            <bitfield id="EN_DEFHOSTADR" description="Enable Default Host Address" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When this bit is 0, the default host address is not matched NOTE: it may still be matched if programmed inside SOAR/SOAR2"/>
                <bitenum id="ENABLE" value="0x1" description="When this bit is 1, default host address of 7h000_1000 is always matched by the slave address match logic."/>
            </bitfield>
            <bitfield id="EN_ALRESPADR" description="Enable Alert Response Address" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When this bit is 0, the alert response address is not matched. NOTE: it may still be matched if programmed inside SOAR/SOAR2"/>
                <bitenum id="ENABLE" value="0x1" description="When this bit is 1, alert response address of 7h000_1100 is always matched by the slave address match logic."/>
            </bitfield>
            <bitfield id="EN_DEFDEVADR" description="Enable Deault device address" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When this bit is 0, the default device address is not matched. NOTE: it may still be matched if programmed inside SOAR/SOAR2."/>
                <bitenum id="ENABLE" value="0x1" description="When this bit is 1, default device address of 7h110_0001 is always matched by the slave address match logic."/>
            </bitfield>
            <bitfield id="SWUEN" description="Slave Wakeup Enable" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, the slave is not allowed to clock stretch on START detection"/>
                <bitenum id="ENABLE" value="0x1" description="When 1, the slave is allowed to clock stretch on START detection and wait for faster clock to be abvailable. This allows clean wake up support for I2C in low power mode use cases"/>
            </bitfield>
        </register>
        <register id="I2C2_SSR" width="32" offset="0xC" description="I2C Slave Status Register">
            <bitfield id="RREQ" description="Receive Request" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No outstanding receive data."/>
                <bitenum id="SET" value="0x1" description="The I2C controller has outstanding receive data from the I2C master and is using clock stretching to delay the master until the data has been read from the SRXDATA FIFO (Slave RX FIFO is full)."/>
            </bitfield>
            <bitfield id="TREQ" description="Transmit Request" begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No outstanding transmit request."/>
                <bitenum id="SET" value="0x1" description="The I2C controller has been addressed as a slave transmitter and is using clock stretching to delay the master until data has been written to the STXDATA FIFO (Slave TX FIFO is empty)."/>
            </bitfield>
            <bitfield id="OAR2SEL" description="OAR2 Address Matched This bit gets reevaluated after every address comparison." begin="3" end="3" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="Either the OAR2 address is not matched or the match is in legacy mode."/>
                <bitenum id="SET" value="0x1" description="OAR2 address matched and ACKed by the slave."/>
            </bitfield>
            <bitfield id="QCMDST" description="Quick Command Status
Value Description:
0: The last transaction was a normal transaction or a transaction has not occurred.
1: The last transaction was a Quick Command transaction" begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The last transaction was a normal transaction or a transaction has not occurred."/>
                <bitenum id="SET" value="0x1" description="The last transaction was a Quick Command transaction."/>
            </bitfield>
            <bitfield id="QCMDRW" description="Quick Command Read / Write 
This bit only has meaning when the QCMDST bit is set. 
Value Description:
0: Quick command was a write
1: Quick command was a read" begin="5" end="5" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="Quick command was a write"/>
                <bitenum id="SET" value="0x1" description="Quick command was a read"/>
            </bitfield>
            <bitfield id="RXMODE" description="Slave FSM is in Rx MODE" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The Slave State Machine is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
                <bitenum id="SET" value="0x1" description="The Slave State Machine is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
            </bitfield>
            <bitfield id="BUSBSY" description="I2C bus is busy" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The I2C Bus is not busy"/>
                <bitenum id="SET" value="0x1" description="The I2C Bus is busy. This is cleared on a timeout."/>
            </bitfield>
            <bitfield id="TXMODE" description="Slave FSM is in TX MODE" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The Slave State Machine is not in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
                <bitenum id="SET" value="0x1" description="The Slave State Machine is in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
            </bitfield>
            <bitfield id="STALE_TXFIFO" description="Stale Tx FIFO" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Tx FIFO is not stale"/>
                <bitenum id="SET" value="0x1" description="The TX FIFO is stale. This occurs when the TX FIFO was not emptied during the previous I2C transaction."/>
            </bitfield>
            <bitfield id="ADDRMATCH" description="Indicates the address for which slave address match happened" begin="18" end="9" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Maximum Value"/>
            </bitfield>
        </register>
