IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/I2C2_1.0.xml
In the normal Slave use case, FW would set PECEN=1 and PECCNT=0 and use the ACKOEN until the remaining SMB packet length is known. FW would then set the PECCNT to the remaining packet length (Including PEC bye). FW would then configure DMA to allow the packet to complete unassisted and exit NoAck mode.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction" begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits accept the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="PEC transmission and check is disabled"/>
                <bitenum id="ENABLE" value="0x1" description="PEC transmission and check is enabled"/>
            </bitfield>
        </register>
        <register id="I2C2_SLAVE_PECSR" width="32" offset="0x28" description="I2C slave PEC status register">
            <bitfield id="PECBYTECNT" description="This is the current PEC Byte Count of the Slave State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates PEC was checked in the transaction that occurred before the last Stop"/>
            </bitfield>
            <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates PEC check error occurred in the transaction that occurred before the last Stop"/>
            </bitfield>
        </register>
    </group>
</module>
